//-------------------------- 게임 프로젝트 --------------------------//
//  						  게임 설명						
// 체스의 퀸과 룩, 비숍이 랜덤하게 나옵니다.			
// 랜덤하게 나오는 말들이 서로 공격하지 않게	최대한 많이 배치를 하는 게임입니다.		
//
// 							   게임 룰						
// 1. 모든 말은 서로의 공격범위에 있지 않아야 합니다.
// 2. 새로운 말을 배치할 때도, 이미 설치된 말을 공격하는 범위에 설치할 수 없습니다.
// 3. 게임 판에 더 이상 말을 배치할 수 없을 경우, 게임이 종료됩니다.
//---------------------------------------------------------------//

public class PuzzleGame
{
	public static GameManager game;
	
	public static void main(String[] args) 
	{
		game = new GameManager();
		game.InitializeGame();
	}
}
